app/controllers/post_images_controller.rb

  def create
    @post_image = PostImage.new(post_image_params)
    @post_image.user_id = current_user.id
    if @post_image.save
---
INSERT INTO "post_images" ("title", "image_id", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @post_image = PostImage.find(params[:id])
    @post_comment = PostComment.new
    @lat = @post_image.map.latitude
    @lng = @post_image.map.longitude
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "maps".* FROM "maps" WHERE "maps"."post_image_id" = ? LIMIT ?  [["post_image_id", 1], ["LIMIT", 1]]
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "maps".* FROM "maps" WHERE "maps"."post_image_id" = ? LIMIT ?  [["post_image_id", 5], ["LIMIT", 1]]