app/views/post_images/show.html.erb

SELECT  "maps".* FROM "maps" WHERE "maps"."post_image_id" = ? LIMIT ?  [["post_image_id", 5], ["LIMIT", 1]]
---
      <div class="show__address">
        <%= @post_image.map.address %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_image_id" = ?  [["post_image_id", 3]]
---
      <%= link_to post_image_favorites_path(@post_image), method: :delete do %>
        ♥<%= @post_image.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_image_id" = ?  [["post_image_id", 3]]
---
      <%= link_to post_image_favorites_path(@post_image), method: :post do %>
        ♡<%= @post_image.favorites.count %> いいね

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 2]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 2]]
---
<div class="comments">
<p>コメント件数：<%= @post_image.post_comments.count %></p>
<% @post_image.post_comments.each do |post_comment| %>